controllers/ClothesController.php

SELECT * FROM `clothes` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Clothes::findOne(['id' => $id])) !== null) {

SELECT * FROM `clothes`
---
    public function actionAllClothes()
    {
        $searchModel = Clothes::find()->all();